newClasses = {
    "小吃快餐":["熟食店","中式麵食店","麵店","餃子店","中式包點店,","冷麵店","小吃店","粥餐廳","快餐店","烤雞速食店","豆腐餐廳"],
    "早午餐":["早午餐餐廳","三文治店","早餐餐廳"],
    "中式料理":["中餐館","台灣餐廳","海鮮餐廳","中菜館","鐵板燒餐廳","雞肉餐廳","亞洲菜餐廳","家常菜餐廳","粵菜館","客家菜館","農家菜館","亞洲","Fusion 菜餐廳","京菜/北京菜館","閩菜/福建菜館","滬菜館","鲁菜/山東菜館"],
    "下午茶":["咖啡廳","咖啡店","麵包西餅店","冰品飲料店","甜品店","甜品餐廳","中式糕餅店","珍珠奶茶店","果汁店","雪糕店"],
    "火鍋":["火鍋餐廳","涮涮鍋餐廳"],
    "日本料理":["日本餐廳","拉麵店","壽司店","日式燒肉餐廳","日式咖哩餐廳","日式烤雞串餐廳","迴轉壽司餐廳","壽喜燒和日式火鍋餐廳","牛丼餐廳","日本地方料理餐廳","正宗日式料理餐廳","日式炸豬扒餐廳","關東煮餐廳","日式牛扒餐廳","日式串燒餐廳","壽喜燒餐廳","天婦羅餐廳","日本熟食店","海鮮丼餐廳","章魚燒餐廳"],
    "素食":["素食餐廳","純素餐廳"],
    "義式料理":["意大利餐廳","意大利麵食店","薄餅餐廳"],
    "美式西餐":["美式牛扒屋","美式扒房","美式餐廳","漢堡餐廳","現代美式餐廳","傳統美式餐廳","西餐廳","中美洲菜餐廳","巴西餐廳","墨西哥餐廳","牛排"],
    "泰式料理":["泰國餐廳"],
    "燒烤":["炸物串與串炸餐廳","串燒烤肉店","燒烤餐廳","酒吧扒房","燒烤","燒烤場"],
    "韓式料理":["韓國餐廳","韓式燒烤餐廳"],
    "越南料理":["越南餐廳","越式河粉餐廳"],
    "自助餐":["自助餐廳","自助餐餐廳"],
    "港式料理":["港式快餐店"],
    "西班牙料理":["西班牙小食餐廳"],
    "海鮮":["海鮮餐廳"],
    "健康輕食料理":["健康食品餐廳","輕食餐廳"],
    "印度料理":["印度餐廳","印度香飯餐廳"],
    "法式料理":["法式餐廳"],
    "酒吧":["酒吧"],
}
a = '酒吧扒房'
for key,value in newClasses.items():
    if a in value:
        print(key)
